{"id":12438,"date":"2010-03-28T15:01:38","date_gmt":"2010-03-28T15:01:38","guid":{"rendered":"https:\/\/alis.vamtam.com\/?p=12438"},"modified":"2019-02-21T13:38:26","modified_gmt":"2019-02-21T13:38:26","slug":"our-wedding","status":"publish","type":"post","link":"https:\/\/alis.vamtam.com\/our-wedding\/","title":{"rendered":"Our Wedding"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\t<strong>Strauss was chief engineer in charge of overall design and construction of the bridge project.However, because he had little understanding or experience with cable-suspension designs, responsibility for much of the engineering and architecture fell on other experts.<\/strong><br \/>\r\nStrauss&#8217;s initial design proposal (two double cantilever spans linked by a central suspension segment) was unacceptable from a visual standpoint. The final graceful suspension design was conceived and championed by Leon Moisseiff, the engineer of the Manhattan Bridge in New York City.\r\n<p>Irving Morrow, a relatively unknown residential architect, designed the overall shape of the bridge towers, the lighting scheme, and Art Deco elements, such as the tower decorations, streetlights, railing, and walkways. The famous International Orange color was originally used as a sealant for the bridge. The US Navy had wanted it to be painted with black and yellow stripes to ensure visibility by passing ships.<\/p>\r\n<p>Senior engineer Charles Alton Ellis, collaborating remotely with Moisseiff, was the principal engineer of the project. Moisseiff produced the basic structural design, introducing his &#8220;deflection theory&#8221; by which a thin, flexible roadway would flex in the wind, greatly reducing stress by transmitting forces via suspension cables to the bridge towers. Although the Golden Gate Bridge design has proved sound, a later Moisseiff design, the original Tacoma Narrows Bridge, collapsed in a strong windstorm soon after it was completed, because of an unexpected aeroelastic flutter. Ellis was also tasked with designing a &#8220;bridge within a bridge&#8221; in the southern abutment, to avoid the need to demolish Fort Point, a pre-Civil War masonry fortification viewed, even then, as worthy of historic preservation. He penned a graceful steel arch spanning the fort and carrying the roadway to the bridge&#8217;s southern anchorage.<\/p>\r\nBelow Golden Gate Bridge<br \/>\r\nEllis was a Greek scholar and mathematician who at one time was a University of Illinois professor of engineering despite having no engineering degree. He eventually earned a degree in civil engineering from the University of Illinois prior to designing the Golden Gate Bridge and spent the last twelve years of his career as a professor at Purdue University. He became an expert in structural design, writing the standard textbook of the time. Ellis did much of the technical and theoretical work that built the bridge, but he received none of the credit in his lifetime. In November 1931, Strauss fired Ellis and replaced him with a former subordinate, Clifford Paine, ostensibly for wasting too much money sending telegrams back and forth to Moisseiff. Ellis, obsessed with the project and unable to find work elsewhere during the Depression, continued working 70 hours per week on an unpaid basis, eventually turning in ten volumes of hand calculations.\r\n<p>With an eye toward self-promotion and posterity, Strauss downplayed the contributions of his collaborators who, despite receiving little recognition or compensation, are largely responsible for the final form of the bridge. He succeeded in having himself credited as the person most responsible for the design and vision of the bridge. Only much later were the contributions of the others on the design team properly appreciated. In May 2007, the Golden Gate Bridge District issued a formal report on 70 years of stewardship of the famous bridge and decided to give Ellis major credit for the design of the bridge.<\/p>\r\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Strauss was chief engineer in charge of overall design and construction of the bridge project.However, because he had little understanding or experience with cable-suspension designs, responsibility for much of the engineering and architecture fell on other experts. Strauss&#8217;s initial design proposal (two double cantilever spans linked by a central suspension segment) was unacceptable from a&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15165,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"video","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[618],"tags":[],"jetpack_featured_media_url":"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/gallery-2-1.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/12438"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=12438"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/12438\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media\/15165"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=12438"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/categories?post=12438"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/tags?post=12438"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}