{"id":303,"date":"2013-09-07T14:03:47","date_gmt":"2013-09-07T14:03:47","guid":{"rendered":"https:\/\/alis.vamtam.com\/?p=303"},"modified":"2019-02-21T13:38:26","modified_gmt":"2019-02-21T13:38:26","slug":"dont-ask-your-girlfriends-dad-if-you-can-marry-her","status":"publish","type":"post","link":"https:\/\/alis.vamtam.com\/dont-ask-your-girlfriends-dad-if-you-can-marry-her\/","title":{"rendered":"Don&#8217;t Ask Your Girlfriend&#8217;s Dad if You Can Marry Her"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\n\t<p><strong>It&#8217;s not a sign of respect. It&#8217;s a deeply sexist practice.<\/strong><\/p>\n<p>It’s the final days of August, which means summer wedding season is finally winding down, and we’ll have a few months of respite before the holiday engagement season – and the attendant ring-on-hand selfies that flood your Facebook feed &#8212; kicks in. In the months before they propose to their partners, men across America will be popping a different question – to their future fiancé’s father, asking for his blessing to marry his daughter.<\/p>\n<p>They shouldn’t.<\/p>\n<p>According to a 2015 survey from TheKnot.com of what appear to be overwhelmingly heterosexual couples, more than three-quarters of men ask for permission from their partner’s father or parents before they propose. By contrast, only 58 percent of brides say they knew a proposal was coming, but just weren’t sure when – for 40 percent, it was a complete surprise. In other words, more men talk to their girlfriend’s father about a plan to marry than talk about marriage, in serious and relatively immediate terms, to the woman they actually want to marry.<\/p>\n<h2>\n\tChallenging conventional\n\t<\/h2>\n<h3>\n\t@WeddingNews\n\t<\/h3>\n\t<p>Challenging conventional wedding traditions may be low on the list of feminist priorities, but that doesn’t mean it’s not important to take a hard look at the rituals and norms we hold dear, or participate in without much thought.<\/p>\n\t<p>Challenging conventional wedding traditions may be low on the list of feminist priorities, but that doesn’t mean it’s not important to take a hard look at the rituals and norms we hold dear, or participate in without much thought. Gender equality isn’t just about getting laws on the books; it’s about changing a culture that situates men as dominant and women as subordinate. And some of the most stubborn and more literal incarnations of a sexist culture come along with weddings – which is why, uncomfortable though it may be, those of us who want a more egalitarian society must take a hard look at how wedding rituals undermine that goal. There’s a lot about American marriage traditions that are sexist, and a lot of sexism that gets rewritten as romance. But perhaps second only to women overwhelmingly folding their names and identities into their husbands when they marry is men asking their girlfriend’s father for permission to marry her. Which is why those of us in feminist relationships should reject that norm – or at least understand that by partaking in it, we’re reinforcing a deeply sexist practice.<\/p>\n<p>The most popular arguments in favor of ask-dad-first seem to be tradition and respect. So let’s tackle each. It is indeed traditional to ask a woman’s father if you can marry her, because traditionally, marriage was a property transfer – with you, the bride, as the property. The legal landscape of marriage has blessedly changed, and no longer does marriage mean that “husband and wife are one, [and] the one is the husband,” as it was under the law of coverture, when women gave up nearly all of their individual rights upon marriage. In those bad old days, a married woman (or married girl, as the case often was) couldn’t own property or refuse sex, or have any separate legal existence from her husband; women were barred from voting in part because the husband was a wife’s legal representative. Happy that the laws around marriage and women have been overhauled so you can be a married woman and an individual with a full set of rights? Thank a feminist. But why romanticize the asking-permission tradition that came out of such backward laws?<\/p>\n<p>“Respect,” the answer goes. But respect for whom – and at who’s expense? In a marriage, you should respect your partner first and foremost. And respecting a woman means not treating her like property, a stereotype instead of an individual, or an appendage to yourself – which means not expecting she take your name, not expecting she’ll do more of the at-home work because she’s the woman, and not asking her father if it’s OK to marry her. There are few things that demonstrate less respect for an adult woman than asking her dad if she’s allowed to make one of the biggest decisions of her life. In an attempt to “respect” a woman’s father, you’re disrespecting her.<\/p>\n<p>Of course, a lot of heterosexual couples do a kind of hybrid between tradition and modernity – they have a series of conversations about marriage and make the mutual decision to wed, and then the future groom has a conversation with his future wife’s father. This is obviously less egregious than a man talking to his partner’s father before ever seriously discussing marriage plans with her, and then springing a surprise proposal on her (please, every woman reading this, if your boyfriend does this, run away as fast as you can – major life decisions are not best made by surprise, and being forced to utter a split second yes\/no to marriage is not romantic; it’s a sign you’re too immature to get married).<\/p>\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>It&#8217;s not a sign of respect. It&#8217;s a deeply sexist practice. It’s the final days of August, which means summer wedding season is finally winding down, and we’ll have a few months of respite before the holiday engagement season – and the attendant ring-on-hand selfies that flood your Facebook feed &#8212; kicks in. In the&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15311,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[604],"tags":[],"jetpack_featured_media_url":"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/12\/post-2.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/303"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=303"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/303\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media\/15311"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=303"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/categories?post=303"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/tags?post=303"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}