{"id":12176,"date":"2017-04-21T10:20:39","date_gmt":"2017-04-21T10:20:39","guid":{"rendered":"https:\/\/alis.vamtam.com\/?page_id=12176"},"modified":"2019-02-21T13:38:25","modified_gmt":"2019-02-21T13:38:25","slug":"our-story","status":"publish","type":"page","link":"https:\/\/alis.vamtam.com\/our-story\/","title":{"rendered":"Our Story"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\n\t<h4>We Anna &amp; Joseph.<br \/>\nWe are so excited to bring you a closer look inside our wedding. <\/h4>\n\t\t\t\t<img src=\"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/Rose-logo-2.svg\" alt=\"Rose-logo-2\" title=\"Rose-logo-2\" \/>\n<h2>\n\tOur beautiful wedding story\n\t<\/h2>\n<h3>\n\tFirst meet\n\t<\/h3>\n\t<p> I’m so excited to bring you a closer look inside Brad and I’s wedding. Today’s post is all about our wedding story, enjoy details on how we met, how he proposed, the planning process, details, advice from the bride and groom and more!<\/p>\n<h3>\n\tFirst kiss\n\t<\/h3>\n\t<p>It all started a little over 5 years ago during our freshman year of college. My college friend lived in the same dorm as Brad and whenever I would visit, she would hi to him in passing. It never donned on me that 5 years later, he would be my husband. One day, Brad was hanging out in the same dorm room I was and the two of us just started conversing. We chatted like we had known each other for years. To my surprise, I pursued Brad. I believe I looked him up on Facebook and messaged him something stupid, just to keep the conversation going. This took place during finals week when everyone was moving out. Brad left school a day before me and I’ll never forget him coming over and helping me move out. What guy helps a girl he just met the day before?<\/p>\n<h3>\n\tFirst &#8220;I love you&#8221;\n\t<\/h3>\n\t<p>Four years after we met, Brad proposed. The two of us had gone on a family vacation with his parents and his middle sister’s family to Myrtle Beach, South Carolina. It was Brad and I’s first real vacation as a couple so I was already super excited. On the second day of vacation, Brad and I spent the day on the beach with his family before he asked if we wanted to get cleaned up, drive around, and get some dinner together. The two of us ended up at a shopping\/tourist area called Barefoot Landing where I picked Joe’s Crab Shack for dinner. Once dinner was over, the two of us drove back to our hotel and walked on the beach at sunset. Brad had me look away while he got down on one knee and proposed. It was perfect!<\/p>\n<h3>\n\tLiving together\n\t<\/h3>\n\t<p>Months before I was even engaged, I was scrolling through Pinterest and found the dress I knew I had to had. Thankfully a bridal shop in a couple of towns over had it. Once we were engaged, I immediately started planning because I’m definitely a planner. Brad and I knew exactly where we wanted to get married, the venue for the reception, and the wedding band. So once we got home, we started getting these things booked. We got engaged in June and by the end of July I had the dress, picked out the bridesmaids dresses picked out, church booked, wedding band booked, and venue reserved.<\/p>\n<h3>\n\tProposial\n\t<\/h3>\n\tMy mom and I spent hours and hours FaceTiming each other to discuss wedding plans.  The rest of the planning went pretty smooth. I knew I wanted the decorations and “theme” to be simple, yet elegant. We opted for bright flowers to go in white milk glass pieces. I really loved the contrast look of bright against white, which is what the bridesmaid dresses were against my dress.<br \/>\nOh the dress, I am so glad I chose this one. When it came to the dress, I knew I wanted something with sleeves. Strapless dresses don’t make me feel comfortable because I’m always afraid they are going to fall. I loved the idea of a thicker strap that sat off the shoulder. There’s just something so classy and elegant off the shoulder. When it came to the skirt, I didn’t want anything too full but still had some flair. The lace detail over this dress is everything I dreamed of as a kid.\n\t\t\t\t<img src=\"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/combined-shape-white-top-01.svg\" alt=\"combined-shape-white-top-01\" title=\"combined-shape-white-top-01\" \/>\n\t\t\t\t<img src=\"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/Rose-logo-2.svg\" alt=\"Rose-logo-2\" title=\"Rose-logo-2\" \/>\n<h2>\n\tAre you attending?\n\t<\/h2>\n\t<p>Kindly respond before the 30th of August<\/p>\n<h4>\n\tR.S.V.P.\n\t<\/h4>\n    Notice: JavaScript is required for this content.\n        <!-- TODO: Move to Template File. -->\n\t\t\t\t<img src=\"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/combined-shape-white-bottom-01.svg\" alt=\"combined-shape-white-bottom-01\" title=\"combined-shape-white-bottom-01\" \/>\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>We Anna &amp; Joseph. We are so excited to bring you a closer look inside our wedding. Our beautiful wedding story First meet I’m so excited to bring you a closer look inside Brad and I’s wedding. Today’s post is all about our wedding story, enjoy details on how we met, how he proposed, the&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/pages\/12176"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=12176"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/pages\/12176\/revisions"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=12176"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}