{"id":1525,"date":"2013-08-28T21:23:54","date_gmt":"2013-08-28T21:23:54","guid":{"rendered":"https:\/\/alis.vamtam.com\/?p=1525"},"modified":"2019-02-21T13:38:26","modified_gmt":"2019-02-21T13:38:26","slug":"best-love-songs-top-100-love-songs-of-all-time","status":"publish","type":"post","link":"https:\/\/alis.vamtam.com\/best-love-songs-top-100-love-songs-of-all-time\/","title":{"rendered":"Best Love Songs: Top 100 Love Songs of All Time"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\n\t<strong>Check out The Knot’s picks of 100 best love songs of all genres to include on your wedding playlist.<\/strong><br \/>\nFinding the perfect soundtrack for your wedding can be a daunting task, especially if you and your partner have different musical tastes. You want love songs that can evoke the right emotion at the right time, like when you&#8217;re enjoying your first dance together or being introduced as a married couple. Thankfully, there&#8217;s a love song for every occasion, from super sweet ballads to upbeat melodies that will have your guests singing along to your playlist.\n<h2>\n\tBest Love Songs of All Time\n\t<\/h2>\n<h3>\n\t\t\t<a href=\"https:\/\/twitter.com\/artofthetattoos?lang=bg\" title=\"@BestWeddingSongs\" target=\"_blank\">\n\t@BestWeddingSongs\n\t\t\t<\/a>\n\t<\/h3>\n\t<p>Finding the perfect soundtrack for your wedding can be a daunting task, especially if you and your partner have different musical tastes. You want love songs that can evoke the right emotion at the right time, like when you&#8217;re enjoying your first dance together or being introduced as a married couple. Thankfully, there&#8217;s a love song for every occasion, from super sweet ballads to upbeat melodies that will have your guests singing along to your playlist.<\/p>\n\t<p><strong>&#8220;In Your Eyes&#8221; by Peter Gabriel<\/strong><\/p>\n<p>This 1986 hit is from the album So, and was featured in the cult classic film Say Anything three years later. It will forever be remembered as the boom box ballad. Who doesn&#8217;t love Lloyd Dobler?<\/p>\n<p><strong>&#8220;Unchained Melody&#8221; by the Righteous Brothers<\/strong><\/p>\n<p>An epic love song from the 1965 album Just Once in My Life. There are a variety of versions floating around, but this particular one was immortalized in the film Ghost.<\/p>\n<p><strong>&#8220;The First Time Ever I Saw Your Face&#8221; by Roberta Flack<\/strong><\/p>\n<p>This chart-topper was originally written by Ewan MacColl for his future wife, making it one of the best courtship gifts in history. Flack made it famous by adding it to her 1969 album First Take.<\/p>\n<p><strong>&#8220;Time After Time&#8221; by Cyndi Lauper<\/strong><\/p>\n<p>An iconic song from the 1984 album She&#8217;s So Unusual, which just so happened to be Lauper&#8217;s solo debut. It went straight to the top of the charts and garnered a Grammy Award nomination.<\/p>\n<p><strong>&#8220;I Will Always Love You&#8221; by Whitney Houston<\/strong><\/p>\n<p>Often considered the standout track from the 1992 soundtrack for The Bodyguard, the mere mention of this song conjures images of Kevin Costner carrying Whitney Houston in his arms.<\/p>\n<p><strong>&#8220;When a Man Loves a Woman&#8221; by Percy Sledge<\/strong><\/p>\n<p>This song is a classic that has been remade time and again by the likes of Bette Midler and Michael Bolton. It first appeared on the 1966 album of the same name, making Sledge an instant R&amp;B legend.<\/p>\n<p><strong>&#8220;Your Song&#8221; by Elton John<\/strong><\/p>\n<p>Everybody wants a song that&#8217;s penned just for them, and Elton John made that possible. This 1970 melody about pure and simple devotion was released as the B-side on Take Me to the Pilot.<\/p>\n<p><strong>&#8220;(They Long to Be) Close to You&#8221; by The Carpenters<\/strong><\/p>\n<p>A remake from the 1970 album Close to You. Thanks to Burt Bacharach&#8217;s lyrics and Karen&#8217;s angelic voice, it nabbed the Grammy Award for Best Contemporary Performance by a Duo, Group or Chorus.<\/p>\n<p><strong>&#8220;My Love&#8221; by Paul McCartney and Wings<\/strong><\/p>\n<p>The muse for this orchestra-backed love song is Linda, Paul McCartney&#8217;s first wife. It holds the distinction of being the best-selling track from their 1973 album Red Rose Speedway.<\/p>\n<p><strong>&#8220;Best of My Love&#8221; by The Emotions<\/strong><\/p>\n<p>This is an upbeat ballad from the 1977 album Rejoice that was written by two members of Earth, Wind &amp; Fire. It remained at the top of the charts for four weeks straight before it went on to win a Grammy Award.<\/p>\n<p><strong>&#8220;Endless Love&#8221; by Diana Ross and Lionel Richie<\/strong><\/p>\n<p>The producers of the film Endless Love were looking for a breakout song for their film starring Brooke Shields. Hence, this famous Ross and Richie melody was born. It also appeared on their 1981 album Why Do Fools Fall in Love.<\/p>\n<p><strong>&#8220;The Power of Love&#8221; by Celine Dion<\/strong><\/p>\n<p>A sensuous and intense remake from the 1993 album The Color of My Love. It was originally penned by Jennifer Rush for her boyfriend Steven, but Dion&#8217;s breathtaking vocal range brings it to life.<\/p>\n<p><strong>&#8220;Annie&#8217;s Song&#8221; by John Denver<\/strong><\/p>\n<p>Denver wrote this 1974 hit for the album Back Home Again while he was riding a ski lift. The inspiration was his wife, Annie, who is the envy of everyone who listens to this heartfelt folk tune.<\/p>\n<p><strong>&#8220;I Want to Know What Love Is&#8221; by Foreigner<\/strong><\/p>\n<p>This song from the 1984 album Agent Provocateur perfectly depicts the despair and hope of love. These lines say it all: &#8220;In my life there&#8217;s been heartache and pain\/I don&#8217;t know if I can face it again\/Can&#8217;t stop now, I&#8217;ve traveled so far, to change this lonely life.&#8221;<\/p>\n<p><strong>&#8220;Crazy For You&#8221; by Madonna<\/strong><\/p>\n<p>A sultry ballad that appeared on the 1985 soundtrack for the film Vision Quest. It was Madonna&#8217;s first foray into slow-dance songs, and it brought her a Grammy Award nomination for Best Female Pop Vocal Performance.<\/p>\n<p><strong>&#8220;You Are the Sunshine of My Life&#8221; by Stevie Wonder<\/strong><\/p>\n<p>The standout tune from Wonder&#8217;s 1973 album Talking Book, this Grammy nominated song is upbeat, catchy and utterly smile-inducing. It&#8217;s no surprise that it earned him the Best Pop Male Vocal Performance award.<\/p>\n<p><strong>&#8220;I Knew I Loved You&#8221; by Savage Garden<\/strong><\/p>\n<p>The number one hit from the 1999 album Affirmation that made every woman swoon. Hearts flutter when Darren Hayes serenades &#8220;I knew I loved you before I met you\/I think I dreamed you into life.&#8221;<\/p>\n<p><strong>&#8220;I Love You Always Forever&#8221; by Donna Lewis<\/strong><\/p>\n<p>Everybody wants a forever kind of love. Lewis gave us the anthem for eternal devotion in 1996, on her album Now in a Minute. It&#8217;s also packed with plenty of poetic imagery, such as &#8220;Those days of warm rains come rushing back to me\/Miles of windless summer night air.&#8221;<\/p>\n<p><strong>&#8220;My Heart Will Go On (Love Theme from &#8216;Titanic&#8217;)&#8221; by Celine Dion<\/strong><\/p>\n<p>The tragic Titanic tune that captures the enduring nature of true love and the longing that comes with it. The song first appeared on Dion&#8217;s 1997 album Let&#8217;s Talk About Love, but the blockbuster hit made it an instant classic.<\/p>\n<p><strong>&#8220;Up Where We Belong&#8221; by Joe Cocker and Jennifer Warnes<\/strong><\/p>\n<p>Cocker and Warnes belted out this 1982 love song for the film An Officer and a Gentleman. It was almost left on the editing room floor, but ended up winning an Academy Award and a Grammy.<\/p>\n<h4>Best Country Love Songs<\/h4>\n<p><strong>&#8220;Wind Beneath My Wings&#8221; by Gary Morris<\/strong><\/p>\nBette Midler&#8217;s version is featured in the tearjerker movie Beaches. However, Morris released this heart wrenching country version in 1983 as part of his Why Lady Why album, which rose to number four on the charts.<br \/>\n<strong>&#8220;I Keep on Lovin&#8217; You&#8221; by Reba McEntire<\/strong>\n<p>McEntire released this true-to-life tune on her 2010 album of the same title. It explores the trials and tribulations of love, with one standout line reminiscing about how &#8220;Sometimes I swear it might be easier to throw in the towel\/Someday we&#8217;re gonna look back and say, Look at us now.&#8221;<\/p>\n<p><strong>&#8220;Through the Years&#8221; by Kenny Rogers<\/strong><\/p>\n<p>Love isn&#8217;t always champagne and roses, which is the topic of Rogers&#8217; 1981 hit from the album Share Your Love. It talks about growing old with the one you love, even when the going gets tough.<\/p>\n<p><strong>&#8220;Remember When&#8221; by Alan Jackson<\/strong><\/p>\n<p>The country crooner wrote this for his 2003 album Greatest Hits Volume II, the inspiration being his relationship with his then-wife. Lyrics like “Remember when 30 seemed so old\/Now lookin&#8217; back \/It&#8217;s just a steppin&#8217; stone,&#8221; look at love in hindsight.<\/p>\n<p><strong>&#8220;When I Said I Do&#8221; by Clint Black and Lisa Hartman Black<\/strong><\/p>\n<p>A country duet featuring a husband and wife team. It appears on the 1999 album D&#8217;lectrified and is one of the go-to songs for wedding DJs. Some of the lyrics even feature vows, such as &#8220;Be faithful and true, devoted to you\/That&#8217;s what I had in mind when I said &#8216;I do.'&#8221;<\/p>\n<p><strong>&#8220;I Will Always Love You&#8221; by Dolly Parton<\/strong><\/p>\n<p>The Whitney Houston version may get all the glory, but Parton&#8217;s rendition of this breathtaking melody was also a chart-topper. It appears on her 1974 Jolene, which is filled to the brim with iconic country tracks.<\/p>\n<p><strong>&#8220;Making Memories of Us&#8221; by Keith Urban<\/strong><\/p>\n<p>A sensuous and blush-worthy hit from the 2004 album Be Here. Lines like &#8220;If there&#8217;s life after this\/I&#8217;m gonna be there to meet you with a warm, wet kiss,&#8221; are sure to make wedding guests swoon.<\/p>\n<p><strong>&#8220;Forever and Ever, Amen&#8221; by Randy Travis<\/strong><\/p>\n<p>This upbeat country classic offers a down-to-earth take on eternal love. Travis recorded it for his 1987 album Forever &amp; Always, and it took home the Grammy for Best Country and Western Song.<\/p>\n<p><strong>&#8220;You&#8217;re Still the One&#8221; by Shania Twain<\/strong><\/p>\n<p>Twain added this intense love song to her 1997 album Come on Over. It was co-written by her husband, Mutt Lange. They have since divorced, but the country ballad is still a wedding staple.<\/p>\n<p><strong>&#8220;Amazed&#8221; by Lonestar<\/strong><\/p>\n<p>Lyrics like &#8220;Every time our eyes meet\/This feeling inside me\/Is almost more than I can take&#8221; make this love song a showstopper. It first appeared on the 1999 album Lonely Grill, and immediately rose to the top of the Billboard charts.<\/p>\n<p><strong>&#8220;Love, Me&#8221; by Collin Raye<\/strong><\/p>\n<p>A beloved 1991 hit from the album All I Can Be. It is one of the top country love songs of all time because it has a little bit of everything—nostalgia, everlasting love and family bonding.<\/p>\n<p><strong>&#8220;I Cross My Heart&#8221; by George Strait<\/strong><\/p>\n<p>This gem from the 1992 Pure Country soundtrack is proof that Strait knows his way around the heart. Everyone wants to hear their sweetheart utter these words: &#8220;I cross my heart and promise to\/Give all I&#8217;ve got to give to make all your dreams come true.&#8221;<\/p>\n<p><strong>&#8220;When You Say Nothing at All&#8221; by Alison Krauss<\/strong><\/p>\n<p>This 1994 country ballad is featured on Keith Whitley: A Tribute Album. It also pays tribute to lovers everywhere who can convey their undying devotion without saying a word.<\/p>\n<p><strong>&#8220;Two Sparrows in a Hurricane&#8221; by Tanya Tucker<\/strong><\/p>\n<p>Tucker&#8217;s country love song from her 1992 album of the same name tells the story of a couple overcoming obstacles. “The world says they&#8217;ll never make it, love says they will&#8221; pretty much sums up the idea of true love.<\/p>\n<p><strong>&#8220;To Make You Feel My Love&#8221; by Garth Brooks<\/strong><\/p>\n<p>A simple—but emotional—tune from the 1998 Hope Floats soundtrack. There are other versions from big artists like Billy Joel and Bob Dylan, but this version packs a poignant punch.<\/p>\n<h4>Best Rock Love Songs<\/h4>\n<p><strong>&#8220;Crazy Little Thing Called Love&#8221; by Queen<\/strong><\/p>\n<p>Queen&#8217;s frontman, Freddie Mercury, wrote this top rock love song while he was soaking in a hotel bathtub. It is featured on their 1979 album The Game and went on to top the charts for four straight weeks.<\/p>\n<p><strong>&#8220;I&#8217;ll Stand By You&#8221; by The Pretenders<\/strong><\/p>\n<p>This 1994 rock ballad from the album Last of the Independents is about sticking together, even when the road gets rocky. As the chorus goes: “I&#8217;ll stand by you, I&#8217;ll stand by you\/Won&#8217;t let nobody hurt you.&#8221;<\/p>\n<p><strong>&#8220;When You Love a Woman&#8221; by Journey<\/strong><\/p>\n<p>A stunning piano rock song from the 1996 album Trial by Fire. Hearts melt when Steve Perry&#8217;s golden chords belt out: “When you love a woman\/You see your world inside her eyes.&#8221;<\/p>\n<p><strong>&#8220;True Love Waits&#8221; by Radiohead<\/strong><\/p>\n<p>Radiohead isn&#8217;t necessarily known for wedding-worthy tracks. However, this rock love song from their 2001 album I Might Be Wrong is a notable exception, with lyrics like: “I&#8217;ll drown my beliefs\/To have your babies.&#8221;<\/p>\n<p><strong>&#8220;Wild Horses&#8221; by The Rolling Stones<\/strong><\/p>\n<p>You know that you&#8217;ve got a good thing going when not even wild horses can drag your sweetheart away. This 1971 classic from the album Sticky Fingers is full of devotion and longing, making it one of the fiercest declarations of love in rock history.<\/p>\n<p><strong>&#8220;Bitter Sweet Symphony&#8221; by The Verve<\/strong><\/p>\n<p>An orchestral rock n&#8217; roll masterpiece from the 1992 album Urban Hymns. It explores life&#8217;s changes, breaking old habits, starting anew and giving love a chance to lead the way.<\/p>\n<p><strong>&#8220;Whole Lotta Love&#8221; by Led Zeppelin<\/strong><\/p>\n<p>Very few people, if any, can listen to this Led Zeppelin classic without breaking out the air guitar. It is featured on their 1969 album Led Zeppelin II, and it still stands the test of time.<\/p>\n<p><strong>&#8220;Love of My Life&#8221; by Queen<\/strong><\/p>\n<p>Queen has no shortage of epic anthems in their catalog. This heart breaker song harkens back to their 1975 album A Night at the Opera, and deals with lost love and longing.<\/p>\n<p><strong>&#8220;Is This Love?&#8221; by Whitesnake<\/strong><\/p>\n<p>&#8220;I can feel my love for you\/Growing stronger day by day&#8221; is just one of the standout lines from this rockin&#8217; ballad, which is from Whitesnake&#8217;s 1987 self-titled album. It speaks to anyone who has found true love for the very first time, and the guitar solo is sure to pluck at your heartstrings.<\/p>\n<p><strong>&#8220;(I Just) Died in Your Arms&#8221; by Cutting Crew<\/strong><\/p>\n<p>The ultimate 1980s sing-a-long for weddings, it was featured on the 1986 Broadcast album and rose to number one on the charts for two consecutive weeks. Since then it has made an appearance on soundtracks for movies like Never Been Kissed and Hot Tub Time Machine.<\/p>\n<p><strong>&#8220;Something&#8221; by the Beatles<\/strong><\/p>\n<p>No top love song countdown is complete without the Beatles. This 1969 rock classic off their famous Abbey Road album was penned by George Harrison for his wife, Pattie.<\/p>\n<p><strong>&#8220;Faithfully&#8221; by Journey<\/strong><\/p>\n<p>This power ballad from the 1983 album Frontiers is one of the few Journey songs to lack a chorus. It&#8217;s all about staying in love, even when you&#8217;re apart, and falling head over heels every time you meet again.<\/p>\n<p><strong>&#8220;You Make Loving Fun&#8221; by Fleetwood Mac<\/strong><\/p>\n<p>A let-your-hair-down type of love song from the 1977 Rumors Album. It&#8217;s optimistic, fun and upbeat, despite the fact that everyone in Fleetwood Mac was having relationship issues at the time.<\/p>\n<p><strong>&#8220;You&#8217;re the Inspiration&#8221; by Chicago<\/strong><\/p>\n<p>A melodic tale of dedication, romance and all-consuming love. This 1984 hit from the album Chicago 17 is full of heartwarming lines like: &#8220;You&#8217;re the meaning in my life\/You&#8217;re the inspiration.&#8221;<\/p>\n<p><strong>&#8220;Everlong&#8221; by Foo Fighters<\/strong><\/p>\n<p>The acoustic version of this song from their 1997 album The Color and the Shape is a wedding soundtrack must-have. Some of its most beautiful lyrics are &#8220;Breathe out\/So I can breathe you in&#8221; and &#8220;And I wonder\/When I sing along with you\/If everything could ever feel this real forever.&#8221;<\/p>\n<h4>Best Indie Love Songs<\/h4>\n<p><strong>&#8220;Sleepwalking&#8221; by Modest Mouse<\/strong><\/p>\n<p>A remake of the 1959 classic with an indie twist. This love song is from the 1996 Interstate 8 album and features a duet that immediately transports the listener back to simpler times.<\/p>\n<p><strong>&#8220;Still Together&#8221; by Mac DeMarco<\/strong><\/p>\n<p>A laid back and beautiful indie melody that appears on the 2012 album 2. Lines like &#8220;And where I go, she&#8217;s at my side half of my life together\/It&#8217;s easy love, fits like a glove from up above together&#8221; are paired with an awe inspiring acoustic guitar.<\/p>\n<p><strong>&#8220;There is a Light That Never Goes Out&#8221; by The Smiths<\/strong><\/p>\n<p>This indie gem is from the 1986 The Queen is Dead. It&#8217;s intense lyrics, such as &#8220;If a double-decker bus crashes into us\/To die by your side is such a heavenly way to die&#8221; aren&#8217;t for the faint of heart, but they are great 1980s dance floor material.<\/p>\n<p><strong>&#8220;Milk &amp; Honey&#8221; by As Tall As Lions<\/strong><\/p>\n<p>It&#8217;s sultry, surreal and dripping with visual imagery. &#8220;Milk &amp; Honey&#8221; hails from the band&#8217;s 2006 self-titled album and covers the darker aspects of love, like loss, betrayal and romantic quarrels.<\/p>\n<p><strong>&#8220;The First Day of My Life&#8221; by Bright Eyes<\/strong><\/p>\n<p>&#8220;Yours is the first face that I saw\/I think I was blind before I met you&#8221; sums up this indie love song about real life romance. It was featured on the 2005 album I&#8217;m Wide Awake, It&#8217;s Morning.<\/p>\n<p><strong>&#8220;Inside and Out&#8221; by Feist<\/strong><\/p>\n<p>A modern rendition of the Bee Gees hit that appears on Feist&#8217;s 2004 Let it Die album. It has an indie jazz vibe, a catchy beat and a heaping helping of soul.<\/p>\n<p><strong>&#8220;I Will Keep the Bad Things from You&#8221; by The Damnwells<\/strong><\/p>\n<p>There are always telltale signs of true love, like keeping the &#8220;price below cost&#8221; or feeding your significant other &#8220;fries with steak sauce.&#8221; This little treasure from the 2003 album Bastards of the Beat explores the lighter, subtler side of romance.<\/p>\n<p><strong>&#8220;The Blower&#8217;s Daughter&#8221; by Damien Rice<\/strong><\/p>\n<p>Rice gave this gift of yearning and haunting vocals to the world via his 2002 album O. Listening to this poignant indie tune leaves you with a dull ache in your chest and a lump in your throat.<\/p>\n<p><strong>&#8220;Such Great Heights&#8221; by The Postal Service<\/strong><\/p>\n<p>Couples who are looking for an upbeat indie track will fall in love with this 2003 single from Give Up. It has appeared on a variety of different shows, including Grey&#8217;s Anatomy.<\/p>\n<p><strong>&#8220;Falling Slowly&#8221; by Glen Hansard and Marketa Irglova<\/strong><\/p>\n<p>Loving your significant other through thick and thin is the moral of this duet. It first appeared on the 2006 movie soundtrack for Once, and has been remade by the likes of Josh Groban and Il Divo.<\/p>\n<p><strong>&#8220;Fix You&#8221; by Coldplay<\/strong><\/p>\n<p>Before Coldplay made it big they were an up-and-coming indie band who recorded this song for their 2005 X&amp;Y album. It was written for Chris Martin&#8217;s late wife, who had just lost her father.<\/p>\n<p><strong>&#8220;Awake&#8221; by Secondhand Serenade<\/strong><\/p>\n<p>&#8220;With every appearance by you, blinding my eyes\/I can hardly remember the last time I felt like I do\/You&#8217;re an angel disguised&#8221; sets the tone for this breakout indie hit. It appeared on the 2007 self-titled debut album, which was a MySpace sensation.<\/p>\n<p><strong>&#8220;The Luckiest&#8221; by Ben Folds<\/strong><\/p>\n<p>A piano ballad from Ben Folds&#8217; 2001 solo debut, Rockin&#8217; the Suburbs. With a tickle of the ivories and honest lyrics, Ben tells the tale of finding your soulmate, and fate leading you to love.<\/p>\n<p>&#8220;Dog Days Are Over&#8221; by Florence and the Machine<\/p>\n<p>One of the standout tracks from the 2009 album Lungs. &#8220;Happiness hit her like a train on a track\/Coming towards her stuck still no turning back&#8221; are the opening lyrics to this fierce indie ballad, which features Florence&#8217;s amazing vocals.<\/p>\n<p><strong>&#8220;Just Like Heaven&#8221; by The Cure<\/strong><\/p>\n<p>Robert Smith, the lead singer of The Cure, wrote this song after a trip to the sea with this soon-to-be wife. They added it to their 1987 album Kiss Me, Kiss Me, Kiss Me and countless artists have been covering it ever since.<\/p>\n<h4>Best Modern Love Songs<\/h4>\n<p><strong>&#8220;Make You Feel My Love&#8221; by Adele<\/strong><\/p>\n<p>Adele is a vocal powerhouse, and her remake of this Bob Dylan classic is tender, romantic and utterly sentimental. It is one of the highlights from her 2008 debut album 19, and the piano lets her soulful voice steal the spotlight.<\/p>\n<p><strong>&#8220;Chasing Cars&#8221; by Snow Patrol<\/strong><\/p>\n<p>Silky vocals and a pure and simple guitar in the background make this 2006 hit from Eyes Open a melodic love potion. It remained in the charts for over two years in the United Kingdom, and appeared on numerous TV shows.<\/p>\n<p><strong>&#8220;We Found Love&#8221; by Rihanna featuring Calvin Harris<\/strong><\/p>\n<p>A dramatic love song that focuses on overcoming the odds to find love and romance in a “hopeless place.&#8221; It appeared on her 2011 album Talk That Talk, meeting both critical acclaim and controversy.<\/p>\n<p><strong>&#8220;Love Song&#8221; by Sara Bareilles<\/strong><\/p>\n<p>The title of this 2007 pop hit from Little Voice says it all. It earned Bareilles a Grammy nomination and kept her in the Billboard Hot 100 charts for 41 weeks.<\/p>\n<p><strong>&#8220;Crazy In Love&#8221; by Beyonce featuring Jay-Z<\/strong><\/p>\n<p>Beyonce&#8217;s solo debut from her 2003 Dangerously in Love is an up-tempo ode to uncontrollable romance. It also features her husband, Jay-Z, who adds a touch of rap to the mix.<\/p>\n<p><strong>&#8220;I&#8217;m Yours&#8221; by Jason Mraz<\/strong><\/p>\n<p>This record-setter is from the 2008 album We Sing. We Dance. We Steal Things. It stayed on the Billboard Hot 100 for 76 weeks and went on to get a Grammy nod for Song of the Year and Best Male Pop Vocal Performance.<\/p>\n<p><strong>&#8220;Bless the Broken Road&#8221; by Rascal Flatts<\/strong><\/p>\n<p>A cover of the Nitty Gritty Dirt Band&#8217;s country love song that sold over two million copies. It originally appeared on the 2004 Hannah Montana: The Movie soundtrack, but lines like &#8220;Every long lost dream led me to where you are&#8221; make it ideally suited for mature audiences.<\/p>\n<p><strong>&#8220;Breathe Me&#8221; by Sia<\/strong><\/p>\n<p>This 2004 soulful Sia masterpiece from Color the Small One is full of longing and regret. However, it also deals with the topic of loving someone so much that they would just warm you up and breathe you in, which is pretty heavy.<\/p>\n<p><strong>&#8220;Bleeding Love&#8221; by Leona Lewis<\/strong><\/p>\n<p>This song, which was featured on the 2007 Spirit album, was inspired by a long distance relationship. Lewis released it just after winning the third season of the hit UK television show, The X Factor, and it spent months on the radio airwaves.<\/p>\n<p><strong>&#8220;Love Story&#8221; by Taylor Swift<\/strong><\/p>\n<p>The muse for this honest and heartfelt tune was Swift&#8217;s former beau, with a little help from Shakespeare. It appeared on the 2008 Fearless album and nabbed the Country Music Association Award for Music Video of the Year.<\/p>\n<p><strong>&#8220;Pusher Love Girl&#8221; by Justin Timberlake<\/strong><\/p>\n<p>Timberlake takes a look at the addictive nature of love in this hit from his 2013 The 20\/20 Experience album. Lines such as: &#8220;Roll you up and let it run through my veins\/&#8217;Cause I can always see the farthest stars when I&#8217;m on you&#8221; let you know that it&#8217;s going to be a different kind of romantic ballad.<\/p>\n<p><strong>&#8220;It Will Rain&#8221; by Bruno Mars<\/strong><\/p>\n<p>One of the standout songs from the 2011 Twilight Saga: Breaking Dawn-Part 1 soundtrack. With lyrics like &#8220;So keep in mind all the sacrifices I&#8217;m makin&#8217;\/To keep you by my side\/To keep you from walkin&#8217; out the door,&#8221; Mars explores the repercussions of a love gone wrong.<\/p>\n<p><strong>&#8220;Adore You&#8221; by Miley Cyrus<\/strong><\/p>\n<p>Total and utter adoration is the theme of this modern love song from Cyrus&#8217; 2013 Bangerz album. She delves into the idea of finding refuge with the one you love and wanting nothing more than to lie with them for all of eternity.<\/p>\n<p><strong>&#8220;My House&#8221; by Kacey Musgraves<\/strong><\/p>\n<p>&#8220;If I can&#8217;t bring you to my house\/I&#8217;ll bring my house to you&#8221; adequately sums up this catchy and quirky love song from the 2013 album, Same Trailer Different Park. It&#8217;s realistic, relatable and down-to-earth, which makes it the perfect wedding dance tune.<\/p>\n<p><strong>&#8220;Use Somebody&#8221; by Kings of Leon<\/strong><\/p>\n<p>A stellar modern rock track that gets your toes tapping and heart soaring. It appeared on their 2008 Only by the Night album and won the Grammy Award for Record of the Year.<\/p>\n<h4>Best Love Songs for Him<\/h4>\n<p><strong>&#8220;The Best&#8221; by Tina Turner<\/strong><\/p>\n<p>This remake of the Bonnie Tyler love song was featured on Turner&#8217;s 1989 Foreign Affair album. The tune has its fair share of catchy rock beats, soulful vocals and unabashed bragging about her lover being &#8220;better than all the rest.&#8221;<\/p>\n<p><strong>&#8220;The Power of Love&#8221; by Celine Dion<\/strong><\/p>\n<p>A cover of Jennifer Rush&#8217;s chart-topper, which appeared on Dion&#8217;s 1993 The Color of My Love. &#8220;Your voice is warm and tender\/A love that I could not forsake&#8221; is just one of the many passionate lines in this number one hit song.<\/p>\n<p><strong>&#8220;As Long As I Got You&#8221; by Lily Allen<\/strong><\/p>\n<p>Allen included this beautiful, yet blunt, love song on her 2014 Sheezus album. It is packed with memorable lines that will have him smiling, such as: &#8220;It seems like only yesterday you were with somebody else\/Soon as it was over though I had claimed you for myself.&#8221;<\/p>\n<p><strong>&#8220;Cherish&#8221; by Madonna<\/strong><\/p>\n<p>Another song to take its cue from Shakespeare&#8217;s star-crossed lovers. &#8220;Cherish&#8221; is from the 1989 album, Like a Prayer, which was Madonna&#8217;s fourth release. It has doo-wop nuances, making it one of her more cheerful ballads.<\/p>\n<p><strong>&#8220;I Have Been Around the World&#8221; by Dar Williams<\/strong><\/p>\n<p>Anyone who&#8217;s ever experience wanderlust can relate to this tune from the 2012 In the Time of Gods album. Lyrics like &#8220;I have been around the world, but all that I can see\/Are these moments that we have, you&#8217;re all the world to me&#8221; explore the idea of being away from the man you love.<\/p>\n<p><strong>&#8220;You Belong to Me&#8221; by Patsy Cline<\/strong><\/p>\n<p>For men who like their partner to take charge and call dibs, Cline&#8217;s ballad from the 1962 Sentimentally Yours album is a top pick. No matter where she goes or who she runs into, her man is still hers, and hers alone.<\/p>\n<p><strong>&#8220;If I Never Met You&#8221; by Barbra Streisand<\/strong><\/p>\n<p>Streisand belts it out in this melody from A Love Like Ours in 1999. Every man wants to hear his partner tell him that &#8220;If I never saw your face\/This world, this world would be a colder place, I bet.&#8221;<\/p>\n<p><strong>&#8220;The Man with the Child in His Eyes&#8221; by Kate Bush<\/strong><\/p>\n<p>Written when Bush was just 13 years of age, this dreamy and ethereal song appeared in 1978 on the album The Kick Inside. It charted in both the United States and the United Kingdom, then went on to be covered by the likes of Charlotte Church and Hue and Cry.<\/p>\n<p><strong>&#8220;Ain&#8217;t No Other Man&#8221; by Christina Aguilera<\/strong><\/p>\n<p>A soulful, gritty and over-the-top tribute that shows up on Aguilera&#8217;s 2006 album, Back to Basics. It has hints of retro musical influences and is inspired by her husband, whom she married the year before.<\/p>\n<p><strong>&#8220;Magic Man&#8221; by Heart<\/strong><\/p>\n<p>An ego-boosting melody that is featured on the Dreamboat Annie album from 1976. The lyrics are full of imagery and tell the autobiographical tale of a young woman falling in love with an older man.<\/p>\n<h4>Best Love Songs for Her<\/h4>\n<p><strong>&#8220;My Girl&#8221; by The Temptations<\/strong><\/p>\n<p>So sweet and innocent, this classic love song for her appears on the 1965 The Temptations Sing Smokey album. Most people remember it from the tearjerker movie of the same name.<\/p>\n<p><strong>&#8220;You Are So Beautiful&#8221; by Joe Cocker<\/strong><\/p>\n<p>This song from the 1974 album, I Can Stand a Little Rain, is sure to make you swoon. Who doesn&#8217;t want to her significant other say: &#8220;You&#8217;re everything I hoped for\/You&#8217;re everything I need?&#8221;<\/p>\n<p><strong>&#8220;Lady&#8221; by Kenny Rogers<\/strong><\/p>\n<p>Start with Lionel Richie&#8217;s writing talents, throw in Rogers&#8217; silky smooth vocals and you end up with this passionate ballad from Kenny Rogers Greatest Hits album that appeared in 1980. It earned a spot on four different music charts: Country, Hot 100, Adult Contemporary, and Top Black Singles.<\/p>\n<p><strong>&#8220;The Lady in Red&#8221; by Chris de Burgh<\/strong><\/p>\n<p>de Burgh&#8217;s wife, Diane, is the lady in red from the song, which appears on his 1986 album Into the Light. It tells the story of meeting someone and remembering everything about the first encounter.<\/p>\n<p><strong>&#8220;Wonderful Tonight&#8221; by Eric Clapton<\/strong><\/p>\n<p>Pattie Boyd was the inspiration for this standout track from the 1977 Slowhand album. Apparently, he penned it while she was getting ready for a party. Most women get sighs and complaints when they take their time getting dressed. She got a song.<\/p>\n<p><strong>&#8220;When a Man Loves a Woman&#8221; by Michael Bolton<\/strong><\/p>\n<p>This is the remake that melted a countless hearts when it appeared in 1991 on Time, Love &amp; Tenderness. It earned Bolton a Grammy Award and a spot at the top of the charts.<\/p>\n<p><strong>&#8220;(Everything I Do) I Do it For You&#8221; by Bryan Adams<\/strong><\/p>\n<p>Every girl would like to be the sole reason that a man does everything. Most people remember this from Robin Hood: Prince of Thieves soundtrack, but it is also featured on the 1991 Waking Up the Neighbors album.<\/p>\n<p><strong>&#8220;Take My Breath Away&#8221; by Berlin<\/strong><\/p>\n<p>The 1986 Top Gun classic that took home an Academy Award and a Golden Globe. It lives up to its name by taking your breath away and recreating the euphoria of new love.<\/p>\n<p><strong>&#8220;Hero&#8221; by Enrique Iglesias<\/strong><\/p>\n<p>Women everywhere wanted Iglesias to be their hero when this song came out on the 2001 Escape album. Lines like &#8220;Would you tremble if I touched your lips?&#8221; make it a sensual and epic love ballad that add a touch of drama to any wedding.<\/p>\n<p><strong>&#8220;I Just Can&#8217;t Stop Loving You&#8221; by Michael Jackson<\/strong><\/p>\n<p>A duet that appears on the unforgettable 1987 Bad album. It features the vocal stylings of Siedah Garrett, and opens with the lines that no hopeless romantic can pass up: &#8220;I just want to lay next to you\/For awhile\/You look so beautiful tonight\/Your eyes are so lovely\/Your mouth is so sweet.&#8221;<\/p>\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Adams also came to understand how important it was that his carefully crafted photos were reproduced to best effect. <\/p>\n","protected":false},"author":2,"featured_media":15325,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[1],"tags":[],"jetpack_featured_media_url":"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/12\/post-6.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/1525"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=1525"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/1525\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media\/15325"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=1525"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/categories?post=1525"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/tags?post=1525"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}