{"id":308,"date":"2014-03-21T21:52:48","date_gmt":"2014-03-21T21:52:48","guid":{"rendered":"https:\/\/alis.vamtam.com\/?p=308"},"modified":"2019-02-21T13:38:26","modified_gmt":"2019-02-21T13:38:26","slug":"8-of-the-best-bits-for-wedding-ideas","status":"publish","type":"post","link":"https:\/\/alis.vamtam.com\/8-of-the-best-bits-for-wedding-ideas\/","title":{"rendered":"8 Of The Best Bits For Wedding Ideas"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\"><strong>For the annual Bridal designers showcase, Harrogate Bridal Show 2016 – Wedding Ideas joined bridal retailers and the biggest names in bridal to celebrate their brand new collection launches for 2017! Over two days (Monday and Tuesday) we met with our nearest and dearest in the Industry to preview for our readers the best to come for 2017 for our brides-to-be. We have to tell you… it’s going to be an incredible year!<\/strong>\r\n\r\nNew concepts, fabrics and cuts will dazzle the market with new limits and colour influences from the catwalk and what we know our British brides to love already! One of the things we noticed when talking to the designers themselves was how much the industry works to improve upon gowns inspired by what brides really want and by extension then what their sisters and friends want too. Also practicality! – We were lucky enough to chat with head designer at Justin Alexander, Tony Mental who expressed real forward thinking in terms of functionality in developed dress linings for benefit of shape and equally comfort. Whether a structured or a streamlined dress, gowns are desired to look flawless and feel every bit as good to wear.\r\n\r\nHere we share with you the BEST bits from the Harrogate Bridal show including dresses, designers and award winners of 2016 – all from the eyes of Wedding Ideas! Watch this space for brand new collections to be revealed soon…\r\n<h1>1<\/h1>\r\n<h3>Dazzled by demetrios<\/h3>\r\nDemetrios definitely did not disapoint with beautifully beaded and embroidery-clad gowns for the ultimate princess dress! Detachable, extending and cascading trains featured heavily in the new collections to take the bride from ceremony to reception with two equally elegant options from a fuller skirt to one that is fit for the dance floor!\r\n<h1>2<\/h1>\r\n<h3>And the winner is…<\/h3>\r\nIn celebration of the huge Harrogate event, the Bridal Buyer Awards also took place during the evening of the second day at Harrogate! The girls at Wedding Ideas didn’t take a lot of persuasion to rise to the occasion of this annual glam event while Boutiques, designers and names also put on their best dresses for a sociable evening of networking, champagne and smart dinner before the year’s awards and winners were revealed! We were thrilled to see the likes of Tony Mental, Justin Alexander, Sassi Holford and Watters take home prestigious awards for their work and devotion to the Industry. Huge Congrats!\r\n<h1>3<\/h1>\r\n<h3>Wedding dress of the year 2016<\/h3>\r\nEach year a finalist panel of the best dress designs of the closing year are put on display for the public at Harrogate and are imminently judged for the awards! Without surprise, Watters stole the show with a romantic sweetheart style with simple tulle skirt and daintily beaded, sparkling bodice!\r\n<h1>4<\/h1>\r\n<h3>Introducing rebecca ingram – Maggie Sottero<\/h3>\r\nMaggie Sottero were proud to present a brand new collection addition their name, Rebecca Ingram – 30 new dress designs inspired by flowing streamlined shapes with soft romantic underlaying and subtle detailing. A particular favourite from the collection envisaged a chic spaghetti strap style – Marjorie – with dainty cross over back detail and gently pleating chiffon skirt. Watch this space for more of the Rebecca Ingram collection on Wedding Ideas coming soon!\r\n<h1>5<\/h1>\r\n<h3>Catherine Parry collection signatures – 1711 and 1713<\/h3>\r\nCatherine Parry showcased the new collection for 2017 with their signature dress for the year 1711 adheres to a minimalist finish in a satin opal fabric, where it’s shape and dramatic skirt take centre stage for design. This dress features a slightly shorter skirt length from the front and descending to the back. An off-the-shoulder neck over neat bodice and impressive seam of satin buttons make sure the bride will wow from every angle. We have to agree Catherine Parry…It’s a fav for us too.\r\n<h1>6<\/h1>\r\n<h3>Justin Alexander trending report<\/h3>\r\nHead designer Tony Mental took us through the design process that makes Justin Alexander so successful and how flawless gowns are continually produced with a specific bride in mind at the forefront of each collection. Each collection boasting a whole spectrum of materials,details, shapes and finishes allowing all types of brides to find something totally functional and beautiful. Tony reported, simpler finishes and satin fabrics with glam vintage hollywood shapes are featuring frequently in bridal fashion as we move into 2017 for that desired chic and glam yet understated and effortless look.\r\n<h1>7<\/h1>\r\n<h3>Enzoani are back and black!<\/h3>\r\nWe were pleasantly surprised to see Enzoani model the only black wedding dress in the show. Featuring petit structuring into a neat full length skirt with a subtle sweetheart neckline and feathery lace detailing – a gown that wore totally elegantly! Brides, what do you think?\r\n<h1>8<\/h1>\r\n<h3>A brand new name for shoes by pink paradox<\/h3>\r\nLadies, we know you can never have enough shoes or shoe choices and Pink Paradox’s’ new name Judith Leiber made a delightful appearance alongside our Pink bridal classics. One of their higher end collections to go into all major department stores, the collection offers a range of elegant and very cosmopolitan shapes and heels heights. Glitz and glitter feature tastefully in many of the designs often available in ivory or silver, navy or black and rosy pink. From a vintage 1920’s peep-toe to stilettos, courts and ankle strap styles for the party bride!<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>For the annual Bridal designers showcase, Harrogate Bridal Show 2016 – Wedding Ideas joined bridal retailers and the biggest names in bridal to celebrate their brand new collection launches for 2017! Over two days (Monday and Tuesday) we met with our nearest and dearest in the Industry to preview for our readers the best to&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15167,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[17],"tags":[],"jetpack_featured_media_url":"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/11\/gallery-4-1.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/308"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=308"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/308\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media\/15167"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=308"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/categories?post=308"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/tags?post=308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}