{"id":5357,"date":"2013-09-06T23:35:16","date_gmt":"2013-09-06T23:35:16","guid":{"rendered":"https:\/\/alis.vamtam.com\/?p=5357"},"modified":"2019-02-21T13:38:26","modified_gmt":"2019-02-21T13:38:26","slug":"prepare-to-be-awestruck-by-the-most-stunning-destination-weddings-youll-see-all-year","status":"publish","type":"post","link":"https:\/\/alis.vamtam.com\/prepare-to-be-awestruck-by-the-most-stunning-destination-weddings-youll-see-all-year\/","title":{"rendered":"Prepare to Be Awestruck By The Most Stunning Destination Weddings You’ll See All Year"},"content":{"rendered":"<div class=\"vgblk-rw-wrapper limit-wrapper\">\t<h3>Electric bike market advisers eCycleElectric have concluded that the U.S. market for pedal assisted bikes could have grown year-on-year by as much as 70% in 2016.<\/h3>\r\n<p>The consultancy run by Patrick and Ed Benjamin has crunched the numbers and believes that the U.S. imported a minimum of 196,000 and likely as many as 251,000 units in 2016. A further 15,000 are believed to have been built domestically by assemblers, putting the firm’s low estimate at 211,000 units.<\/p>\r\n<p>Ed Benjamin told CyclingIndustry.News: “Due to complexities in tracking these numbers, we suspect that the actual number may 20% higher, thus giving us our upper-limit figure of 251,000 units. That would represent a 70% increase.”<\/p>\r\nSpeaking on the difficulties of tracking the market’s exact figures, Benjamin said that without a specific HS code, something which pedal assist bikes lack at present, records are harder to define.<br \/>\r\n“This leads to a tedious process of evaluating thousands of individual records, one at a time, by hand. Such a process is subject to both human errors and definition confusion; many products that would not be conventionally regarded as an “electric bike” may be listed as such, or in similar terms,” offers Benjamin. “Our figure of 40,000 additional imported bikes is intended to realistically encompass both our likely margin of error and bikes that are either poorly defined within the record, not described with any of the 60 terms we search under, or simply mislabeled entirely. The remaining 15,000 USA assembled bikes is based on data gathered through our relationships with USA assemblers, retailers, brand managers, OEMs, component suppliers, and sales reps.”\r\n<p>Ebikes were imported by approximately 135 entities during this period, found eCycleElectric. Most came from China, but also from Taiwan, Korea, and elsewhere.<\/p>\r\n<p>The largest importers were ebike specialists, followed by major bicycle brands. A large number of bikes were imported by specialist ebike retailers. Other importers  included sporting goods stores, online sales, and mass merchants.<\/p>\r\n<p>Many small importers brought in shipments of 6 to 50 bikes. These are thought to be start ups, retailers, and companies considering the ebike business.<\/p>\r\n<h3>Does it all translate to sales?<\/h3>\r\n<p>“If stock languishing in warehouses were a widespread problem grumbling in the supply side would be heard loudly and clearly. As it is, grumbling has been absent, so we feel that most of the ebikes entering the market are being sold, and easily,” starts Benjamin.<\/p>\r\n<p>Sources within the industry have indeed told eCycleElectric that unit sales have risen by as much as three fold year-on-year, with many more pointing to increases between 40 and 70% during 2016.<\/p>\r\n<p>“This aligns with our observations, and thus we feel confident that the path from importer to customer is, at the moment, fairly well-lubricated,” says Benjamin.<\/p>\r\n<p>“An often overlooked detail of the USA ebike market is that it cannot be as easily compared to the bicycle market as we might like. A figure of a quarter-million bicycles sounds unimpressive for an industry that moves in tens of millions in the USA. However, with the average ebike somewhere between $1,000 and $3,000, with many examples reaching towards (or even past) $6,000, this small volume represents a larger slice than is immediately obvious.<\/p>\r\n<p>“Thus we feel that the overall picture of the market is this: Sales are up, some (but not all) companies are growing fast, and this small, yet profitable, industry segment is continuing to grow due to a variety of global and USA trends.”<\/p>\r\n<h3>To contact Benjamin directly head on over to www.eCycleElectric.com.<\/h3>\r\n<p>Within Europe, manufacturers like Cube are drastically expanding the scope of their electric bike production. Head here for our interview with CEO Marcus Purner.<\/p>\r\n<\/div><!-- .vgblk-rw-wrapper -->","protected":false},"excerpt":{"rendered":"<p>Electric bike market advisers eCycleElectric have concluded that the U.S. market for pedal assisted bikes could have grown year-on-year by as much as 70% in 2016. The consultancy run by Patrick and Ed Benjamin has crunched the numbers and believes that the U.S. imported a minimum of 196,000 and likely as many as 251,000 units&#8230;<\/p>\n","protected":false},"author":2,"featured_media":15315,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_price":"","_stock":"","_tribe_ticket_header":"","_tribe_default_ticket_provider":"","_tribe_ticket_capacity":"0","_ticket_start_date":"","_ticket_end_date":"","_tribe_ticket_show_description":"","_tribe_ticket_show_not_going":false,"_tribe_ticket_use_global_stock":"","_tribe_ticket_global_stock_level":"","_global_stock_mode":"","_global_stock_cap":"","_tribe_rsvp_for_event":"","_tribe_ticket_going_count":"","_tribe_ticket_not_going_count":"","_tribe_tickets_list":[],"_tribe_ticket_has_attendee_info_fields":false},"categories":[17],"tags":[],"jetpack_featured_media_url":"https:\/\/alis.vamtam.com\/wp-content\/uploads\/2017\/12\/post-3.jpg","jetpack_sharing_enabled":true,"_links":{"self":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/5357"}],"collection":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/comments?post=5357"}],"version-history":[{"count":0,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/posts\/5357\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media\/15315"}],"wp:attachment":[{"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/media?parent=5357"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/categories?post=5357"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/alis.vamtam.com\/wp-json\/wp\/v2\/tags?post=5357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}